{
  "source": "http://tntisland.com/trinbagofacts.html",
  "page_title": "Trinidad & Tobago facts.... did you know????",
  "category": "island_info",
  "scraped_at": "2026-02-01",
  "data": [
    {
      "fact": "1. The Steelpan: The only new acoustic instrument to be invented and accepted worldwide in the 20th century originated in Trinidad and Tobago.\n2. Trinidad and Tobago is home to the world’s largest traffic roundabout around the Queen’s Park Savannah.\n3. In 2006, Trinidad and Tobago became the smallest country ever to qualifier for the 2006 Football World Cup.\n4. Trinidad and Tobago contestant Ms Janelle “Penny” Commissiong was the first Black Miss Universe in 1977.\n5. Trinidad and Tobago’s Brian Charles Lara holds the record for the highest individual score in a test innings (400 not out against England, Antigua 2004). He is also the only batsman to have ever scored a hundred, a double century, a triple century, a quadruple century and a quintuple century in first class games over the course of a senior career.\n6. Trinidad and Tobago is one of the oldest hydrocarbon producers in the world, with commercial production dating as early as 1908. Trinidad and Tobago is also a major petrochemical hub and is the one of the world’s largest exporters of ammonia, ethanol and liquefied natural gas. The two largest methanol plants in the world are found in Trinidad.\n7. The Leatherback Turtle: the largest of all living turtles chooses the shores of Trinidad and Tobago as one of its nesting grounds. Trinidad and Tobago is one of the most important leatherback nesting sites.\n8. The Pitch Lake: The Pitch Lake in South Trinidad is the largest natural deposit of asphalt in the world.\n9. Trinidad and Tobago is the birthplace of calypso, a style of Afro-Caribbean music that gained international popularity in the 1950s, primarily through the music of Harry Belafonte.\n10. Trinidad and Tobago Carnival has been consistently ranked as one of the top ten Carnival celebrations in the world. It is popularly known as “The Greatest Show on Earth”. The founder of the Notting Hill Carnival, Europe’s largest street festival, Claudia Jones, also hails from Trinidad and Tobago.\n11. The limbo dance originated as an event that took place at wakes in Trinidad and Tobago, but became internationally renowned through the work of Julia Edwards and her dance company in the 1960s.\n12. The oldest rainforest reserve in the Western Hemisphere is located in Tobago. Little Tobago is home to the world’s largest brain coral. Trinidad and Tobago has over 400 species of birds, making it one of the richest birding countries per square mile.\n13. Tobago was the location of Daniel Defoe’s classic Robinson Crusoe. Tobago is also widely believed to be the place Robert Louis Stevenson had in mind when he penned Treasure Island.\n14. On August 1, 1985 Trinidad and Tobago became the world’s first country to declare a public holiday in commemoration of the abolition of slavery.\n15. Trinidad and Tobago-born Stokley Carmichael (also known as Kwame Ture) was a member of the United States Civil Rights Movement who rose to prominence as the Honorary Prime Minister of the Black Panther Party. He popularized the term “black power” as a social and political slogan.\n16. The only national to serve as Prime Minister and President of Trinidad and Tobago, ANR Robinson was instrumental in the establishment of the International Criminal Court (ICC) during his tenure as Prime Minister from 1986-1991. In 1989, during the 44th session of the UN General Assembly, Prime Minister Robinson proposed the creation of the court, which was eventually inaugurated in 2002 to hear cases of crimes against humanity.\n17. Trinidad and Tobago’s Dr Joseph Lennox Pawan achieved international acclaim for the discovery of the transmission of the rabies virus by vampire bats. This led to the development of a vaccine for the virus.\n18. Born in Trinidad and Tobago, Eugene Chen left behind a successful career and moved to China where he founded the Peking Gazette. Chen later became the Foreign Minister to four successive governments and the personal adviser to Sun Yat-Sen, the founder of Nationalist China.\n19. The Trinidad accent ranks 10th on the CNN’s top ten sexiest accents in the world.\n20. The Trinidad Moruga “Scorpion” Pepper has officially been ranked as the world’s hottest pepper by the Guinness Book of Records. \nCredit to Paul Gordon for this list",
      "type": "did_you_know"
    }
  ]
}